Revit 2026 API

# ViewCropRegionShapeManagerGetSplitRegionOffset Method

---

Returns the offset for the specified split crop region.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetSplitRegionOffset(
	int regionIndex
)
```
```vb
Public Function GetSplitRegionOffset (
	regionIndex As Integer
) As XYZ
```
```cpp
public:
XYZ^ GetSplitRegionOffset(
	int regionIndex
)
```
```fsharp
member GetSplitRegionOffset :
        regionIndex : int -> XYZ
```

#### Parameters

regionIndex Int32
     Index of the split crop region (numbering starts with 0).

#### Return Value

XYZ A vector in model space representing the offset which is applied to the split crop region's boundary.

| Exception | Condition |
| --- | --- |
| ArgumentException | The provided region index is invalid. |

The points in the split crop region's boundary are not in model space. Add the offset returned by this method to each point in the crop region's boundary to transform the points into model space coordinates.

#### Reference

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace